In [1]:
# 0. Import necessary libraries
import pandas as pd #to read dataset
import numpy as np #arrays indexing, math operations, slicing
import matplotlib.pyplot as plt #for charts
import seaborn as sns #for charts

In [2]:
# point to data path 
data_path = r"D:\python_da\email_subscription.csv"

#read the csv file from path and put in the variable df
df = pd.read_csv(data_path)

In [3]:
#check number of roles and columns
df.shape

(9999, 11)

In [4]:
#check properties of dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 11 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   id                           9999 non-null   object
 1   Type                         9999 non-null   object
 2   StatUnmarrieds               9999 non-null   object
 3   City                         9926 non-null   object
 4   State                        9874 non-null   object
 5   PostalCode                   9998 non-null   float64
 6   GenderCode                   9999 non-null   object
 7   BirthDate                    9999 non-null   object
 8   MarriedaritalStatUnmarrieds  9999 non-null   object
 9   Enrolled on                  9999 non-null   object
 10  Living statUnmarrieds        9999 non-null   object
dtypes: float64(1), object(10)
memory usage: 859.4+ KB

In [5]:
#read first 5 rows of dataset
df.head()

,id,Type,StatUnmarrieds,City,State,PostalCode,GenderCode,BirthDate,MarriedaritalStatUnmarrieds,Enrolled on,Living statUnmarrieds
0,00005DCC-4E51-41A5-91C5-6635B24C7D17,BUnmarriedsiness,InActive,NaN,NaN,500024.0,MALE,12-Aug-18,Unmarried,12-Aug-18,coUnmarriedple with children
1,0001F49E-9FE7-11e8-9E9C-00505682069A,Individual,Active,Valsad,GUJARAT,396001.0,MALE,2-Nov-92,Married,14-Aug-18,couple with children
2,0001F4A2-9FE7-11e8-9E9C-00505682069A,Individual,Active,Secunderabad,TELANGANA,500011.0,FEMALE,25-Nov-88,Married,14-Aug-18,couple with children
3,0001F4CD-9FE7-11e8-9E9C-00505682069A,Individual,Active,Nalgonda,TELANGANA,508101.0,MALE,13-Jun-83,Married,14-Aug-18,couple with children
4,0001F4DE-9FE7-11e8-9E9C-00505682069A,Individual,Active,Hyderabad,TELANGANA,500028.0,MALE,13-Jul-75,Married,14-Aug-18,couple with children

In [6]:
#summary description of numeric column
df.describe()

          PostalCode
count    9998.000000
mean   473095.998700
std     84723.960236
min      8905.000000
25%    411030.500000
50%    500034.000000
75%    500082.000000
max    854337.000000

In [10]:
#isolate only postal code and analyse
PostalCode = df["PostalCode"]
percentile10 = np.percentile(PostalCode,10)
print(percentile10)

nan

In [ ]:
#find non-numeric columns
non_numeric = df.dtypes[df.dtypes == 'object'].index
print(non_numeric)

#summarize non-numeric columns 
df[non_numeric].describe()

Index(['id', 'Type', 'StatUnmarrieds', 'City', 'State', 'GenderCode',
       'BirthDate', 'MarriedaritalStatUnmarrieds', 'Enrolled on ',
       'Living statUnmarrieds'],
      dtype='object')

,id,Type,StatUnmarrieds,City,State,GenderCode,BirthDate,MarriedaritalStatUnmarrieds,Enrolled on,Living statUnmarrieds
count,9999,9999,9999,9926,9874,9999,9999,9999,9999,9999
unique,9999,4,3,391,37,4,6719,2,577,5
top,00005DCC-4E51-41A5-91C5-6635B24C7D17,Individual,Active,Hyderabad,TELANGANA,MALE,1-Jan-00,Married,12-Aug-18,couple with children
freq,1,9484,9899,2639,4304,6886,244,9675,209,4731